; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v4 - type_1 ?v2 - type_2)
 	      (pred_2 ?v6 - object ?v2 - type_2)
	      (pred_4 ?v4 - type_1 ?v5 - type_3)
	      (pred_3 ?v4 - type_1 ?v6 - object ?v5 - type_3))

   (:action op_3
       :parameters  (?v4 - type_1 ?v1 ?v8 - type_2)
       :precondition (and  (pred_1 ?v4 ?v1))
       :effect (and  (pred_1 ?v4 ?v8)
		     (not (pred_1 ?v4 ?v1))))

   (:action op_1
       :parameters (?v4 - type_1 ?v3 - object ?v7 - type_2 ?v5 - type_3)
       :precondition  (and  (pred_2 ?v3 ?v7) (pred_1 ?v4 ?v7) (pred_4 ?v4 ?v5))
       :effect (and (pred_3 ?v4 ?v3 ?v5)
		    (not (pred_2 ?v3 ?v7)) 
		    (not (pred_4 ?v4 ?v5))))

   (:action op_2
       :parameters (?v4 - type_1 ?v3 - object ?v7 - type_2 ?v5 - type_3)
       :precondition  (and  (pred_3 ?v4 ?v3 ?v5) (pred_1 ?v4 ?v7))
       :effect (and (pred_2 ?v3 ?v7)
		    (pred_4 ?v4 ?v5)
		    (not (pred_3 ?v4 ?v3 ?v5)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_04 - type_1
obj_08 obj_02 - type_3
obj_05 obj_09 obj_06 obj_01 - type_2
obj_07 obj_03 obj_10 - object)
(:init
(pred_1 obj_04 obj_06)
(pred_4 obj_04 obj_08)
(pred_4 obj_04 obj_02)
(pred_2 obj_07 obj_05)
(pred_2 obj_03 obj_09)
(pred_2 obj_10 obj_09)
)
(:goal
(and
(pred_2 obj_07 obj_01)
(pred_2 obj_03 obj_05)
(pred_2 obj_10 obj_05)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_04 ?b obj_02))))
)
)

; plan
1. (op_3 obj_04 obj_06 obj_05)
   deleted: (pred_1 obj_04 obj_06)
   added: (pred_1 obj_04 obj_05)
   goals met: 0 of 3
2. (op_1 obj_04 obj_07 obj_05 obj_08)
   deleted: (pred_2 obj_07 obj_05) (pred_4 obj_04 obj_08)
   added: (pred_3 obj_04 obj_07 obj_08)
   goals met: 0 of 3
3. (op_3 obj_04 obj_05 obj_01)
   deleted: (pred_1 obj_04 obj_05)
   added: (pred_1 obj_04 obj_01)
   goals met: 0 of 3
4. (op_2 obj_04 obj_07 obj_01 obj_08)
   deleted: (pred_3 obj_04 obj_07 obj_08)
   added: (pred_2 obj_07 obj_01) (pred_4 obj_04 obj_08)
   goals met: 1 of 3
5. (op_3 obj_04 obj_01 obj_09)
   deleted: (pred_1 obj_04 obj_01)
   added: (pred_1 obj_04 obj_09)
   goals met: 1 of 3
6. (op_1 obj_04 obj_03 obj_09 obj_08)
   deleted: (pred_2 obj_03 obj_09) (pred_4 obj_04 obj_08)
   added: (pred_3 obj_04 obj_03 obj_08)
   goals met: 1 of 3
7. (op_3 obj_04 obj_09 obj_05)
   deleted: (pred_1 obj_04 obj_09)
   added: (pred_1 obj_04 obj_05)
   goals met: 1 of 3
8. (op_2 obj_04 obj_03 obj_05 obj_08)
   deleted: (pred_3 obj_04 obj_03 obj_08)
   added: (pred_2 obj_03 obj_05) (pred_4 obj_04 obj_08)
   goals met: 2 of 3
9. (op_3 obj_04 obj_05 obj_09)
   deleted: (pred_1 obj_04 obj_05)
   added: (pred_1 obj_04 obj_09)
   goals met: 2 of 3
10. (op_1 obj_04 obj_10 obj_09 obj_08)
   deleted: (pred_2 obj_10 obj_09) (pred_4 obj_04 obj_08)
   added: (pred_3 obj_04 obj_10 obj_08)
   goals met: 2 of 3
11. (op_3 obj_04 obj_09 obj_05)
   deleted: (pred_1 obj_04 obj_09)
   added: (pred_1 obj_04 obj_05)
   goals met: 2 of 3
12. (op_2 obj_04 obj_10 obj_05 obj_08)
   deleted: (pred_3 obj_04 obj_10 obj_08)
   added: (pred_2 obj_10 obj_05) (pred_4 obj_04 obj_08)
   goals met: 3 of 3
